[
    "I meant to look for my missing watch, but I could never find the time.",
    "Did you hear about that great new shovel? It's ground breaking.",
    "This whiteboard is remarkable.",
    "Inspecting mirrors is a job I could really see myself doing.",
    "Two antennas got married last Saturday. The reception was fantastic.",
    "Writing with a dull pencil is pointless.",
    "No matter how much you push the envelope, it'll still be stationery.",
    "The golfer brought an extra pair of pants in case he got a hole in one.",
    "Why does Peter Pan fly all the time? He Neverlands.",
    "I did a performance about puns. Really it was just a play on words.",
    "What do you call an alligator in a vest? An investigator.",
    "What would you call a fish with a missing eye? A fsh, probably.",
    "My dog can do magic tricks. It's a labracadabrador.",
    "I used to have a fear of hurdles, but I got over it.",
    "My fear of moving stairs is escalating.",
    "I wanted to buy a camouflage shirt, but I didn't see one.",
    "The dead batteries were given out free of charge.",
    "Broken puppets for sale. No strings attached.",
    "Once you've seen one shopping center you've seen a mall.",
    "I once heard a joke about amnesia, but I forgot how it goes.",
    "Never lie to an x-ray technician. They can see right through you.",
    "Jill broke her finger today. On the other hand she was completely fine.",
    "To the guy who invented Zero: Thanks for nothing!",
    "When you dream in color, is it a pigment of your imagination?",
    "I'd ask my teddy bear if he's hungry, but he's stuffed.",
    "The grape didn't say much when he got stepped on. He just let out a little wine.",
    "I took a picture of a field of wheat. It was grainy.",
    "Yesterday I swallowed some food coloring. I feel like I've dyed a little inside.",
    "What do you call a bear with no ears? A b",
    "Light travels faster than sound. That's why some people appear bright until you hear them speak.",
    "I have a few jokes about unemployed people, but none of them work.",
    "Will glass coffins be a success? Remains to be seen",
    "I can't believe I got fired from the calendar factory. All I did was take a day off.",
    "The man who survived pepper spray and mustard gas is now a seasoned veteran",
    "What do you call a bee that can't make up its mind? A maybe",
    "I tried to sue the airline for losing my luggage. I lost my case.",
    "How do you make holy water? You boil the hell out of it.",
    "Ghosts are terrible liars... You can see right through them.",
    "You can spell water as **hijklmno**. It's H to O.",
    "Son: What rhymes with purple? Dad: No it doesn't...",
    "Did you hear about the guy that stole the calendar? He got 12 months.",
    "How do you use a remore control to calm down a robot dog? Press the paws button.",
    "Where did Noah keep his bees? In the Ark hives.",
    "Went to a moneu printing factory today. The machines didn't really make cents to me.",
    "The furniture store keeps calling me to come back. But all I wanted was one night stand.",
    "When everything is coming your way, you're in the wrong lane.",
    "A cross-eyed teacher couldn’t control his pupils.",
    "She had a photographic memory but never developed it.",
    "When the past, present, and future go camping they always argue. It's intense tense in tents",
    "What did the janitor say when he jumped out of the closet? SUPPLIES!",
    "Is it ignorance or apathy that's destroying the world today? I don't know and don't really care.",
    "Lol canadixn was here!",
    "Junes over? Julying.",
    "How does a dog stop a video? By hitting the paws button!",
    "People think **icy** is the easiest word to spell. Come to think of it, I see why.",
    "My teachers told me I'd never amount to much because I procrastinate so much. I told them, 'Just you wait!'",
    "What's a balloon's least favorite type of music? Pop.",
    "What does the world's top dentist get? A little plaque.",
    "My friend told me what rhymes with with orange. I said no it doesn't!",
    "How does NASA organize a party?They planet.",
    "How many tickles does it take to get an octopus to laugh? Ten tickles.",
    "What did one toilet say to the other? You look flushed.",
    "Want to hear a roof joke? The first one's on the house.",
    "It's always windy in a sports area. All those fans."
]